Documents/Спринт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Спринт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СпринтыПоСделкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСпринта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСпринта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланНаНеделю</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактПоИтогамНедели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделали</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучилиЖелаемыйРезультат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выводы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СпринтыПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>СпринтыПоСделкам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сделали</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияСпринта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучилиЖелаемыйРезультат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПланНаНеделю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактПоИтогамНедели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выводы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаБитрикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаNotion</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Калибр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КалибрыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Спринт/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ТекущаяНеделя = НеделяГода(ТекущаяДата()); 
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СпринтыПоСделкамСрезПоследних.Ответственный КАК Ответственный,
	//	|	НЕДЕЛЯ(СпринтыПоСделкамСрезПоследних.Регистратор.Дата) КАК Неделя
	//	|ИЗ
	//	|	РегистрСведений.СпринтыПоСделкам.СрезПоследних(, НЕДЕЛЯ(Регистратор.Дата) = &Неделя) КАК СпринтыПоСделкамСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Неделя", ТекущаяНеделя);
	//ЗАпрос.УстановитьПараметр("Ответственный
	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если НЕ РезультатЗапроса.Пустой() И Объект.Ответственный.Наименование = "" Тогда
	//	Сообщить("На этой неделе уже создавался документ!");
	//	Отказ = Истина;
	//КонецЕсли;	
//>>
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
	//Состав = Элементы.СоставСпринта.ТекущиеДанные;
	//
	//Для каждого ЭлементМассива из ДанныеТаблицы Цикл
	//	Для каждого элемент из ЭлементМассива Цикл
	//		
	//	КонецЦикла;	
	//КонецЦикла;
	//
	//Состав = Элементы.СоставСпринта.ТекущиеДанные;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если Объект.Ответственный.Пустая() Тогда
		Сообщить("Выберите Ответственного!");
		Отказ = истина;
		Возврат;
	КонецЕсли;	
	
	
	//<<Невозможно проводить заполнение, если есть более новый документ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпринтыПоСделкам.Регистратор.Дата КАК РегистраторДата,
		|	СпринтыПоСделкам.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.СпринтыПоСделкам КАК СпринтыПоСделкам
		|ГДЕ
		|	СпринтыПоСделкам.Регистратор.Дата > &Дата
		|	И СпринтыПоСделкам.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ответственный", Объект.Ответственный);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Сообщить("Невозможно загрузить сделки! Присутствует болле новый документ!");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	//Невозможно проводить заполнение, если есть более новый документ>>

	
	
	//Защита от повторного нажатия, добавляются только те строки, которых еще нет в документе
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сделки.Аккаунт КАК Аккаунт,
		|	Сделки.Ссылка КАК Сделка,
		|	Сделки.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВТ_Сделки
		|ИЗ
		|	Справочник.Сделки КАК Сделки
		|ГДЕ
		|	Сделки.Аккаунт = &Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпринтыПоСделкамСрезПоследних.ДатаЗавершенияСпринта КАК ДатаЗавершенияСпринта,
		|	ВТ_Сделки.Сделка КАК Сделка,
		|	ВТ_Сделки.Клиент КАК Клиент,
		|	СпринтыПоСделкамСрезПоследних.Ответственный КАК Ответственный,
		|	СпринтыПоСделкамСрезПоследних.ТекущийСтатус КАК ТекущийСтатус,
		|	СпринтыПоСделкамСрезПоследних.НовыйСтатус КАК НовыйСтатус,
		|	СпринтыПоСделкамСрезПоследних.ФактическийСтатус КАК ФактическийСтатус,
		|	СпринтыПоСделкамСрезПоследних.Сделали КАК Сделали,
		|	СпринтыПоСделкамСрезПоследних.ПланНаНеделю КАК ПланНаНеделю,
		|	СпринтыПоСделкамСрезПоследних.ФактПоИтогамНедели КАК ФактПоИтогамНедели,
		|	СпринтыПоСделкамСрезПоследних.ПолучилиЖелаемыйРезультат КАК ПолучилиЖелаемыйРезультат,
		|	СпринтыПоСделкамСрезПоследних.Выводы КАК Выводы
		|ИЗ
		|	ВТ_Сделки КАК ВТ_Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпринтыПоСделкам.СрезПоследних(
		|				&ТекущаяДата,
		|				Ответственный = &Ответственный
		|					И НЕ (Сделка, Клиент) В
		|							(ВЫБРАТЬ
		|								СпринтСоставСпринта.Сделка КАК Сделка,
		|								СпринтСоставСпринта.Клиент КАК Клиент
		|							ИЗ
		|								Документ.Спринт.СоставСпринта КАК СпринтСоставСпринта
		|							ГДЕ
		|								СпринтСоставСпринта.Ссылка = &Ссылка)) КАК СпринтыПоСделкамСрезПоследних
		|		ПО ВТ_Сделки.Аккаунт = СпринтыПоСделкамСрезПоследних.Ответственный
		|			И ВТ_Сделки.Сделка = СпринтыПоСделкамСрезПоследних.Сделка
		|			И ВТ_Сделки.Клиент = СпринтыПоСделкамСрезПоследних.Клиент";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Ответственный", Объект.Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТаблицаЗначений = Объект.СоставСпринта.Выгрузить();		
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
			СтрокаТЧ = Объект.СоставСпринта.Добавить();
			СтрокаТЧ.Сделка = ВыборкаДетальныеЗаписи.Сделка;
			СтрокаТЧ.Клиент = ВыборкаДетальныеЗаписи.Клиент;
			СтрокаТЧ.ТекущийСтатус = ВыборкаДетальныеЗаписи.ТекущийСтатус;
			СтрокаТЧ.НовыйСтатус = ВыборкаДетальныеЗаписи.НовыйСтатус;
			СтрокаТЧ.ФактическийСтатус = ВыборкаДетальныеЗаписи.ФактическийСтатус;
			СтрокаТЧ.ПланНаНеделю = ВыборкаДетальныеЗаписи.ПланНаНеделю;
			СтрокаТЧ.ФактПоИтогамНедели = ВыборкаДетальныеЗаписи.ФактПоИтогамНедели;
			СтрокаТЧ.Сделали = ВыборкаДетальныеЗаписи.Сделали;
			СтрокаТЧ.ПолучилиЖелаемыйРезультат = ВыборкаДетальныеЗаписи.ПолучилиЖелаемыйРезультат;
			СтрокаТЧ.Выводы = ВыборкаДетальныеЗаписи.Выводы;	
	КонецЦикла;	

//>>		
КонецПроцедуры
